# 1. Создать класс TrafficLight (светофор).
# определить у него один атрибут color (цвет) и метод running (запуск);
# атрибут реализовать как приватный;
# в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# продолжительность первого состояния (красный) составляет 7 секунд, второго
# (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
# переключение между режимами должно осуществляться только в указанном порядке \
#     (красный, жёлтый, зелёный);
# проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов.
# При его нарушении выводить соответствующее сообщение и завершать скрипт.

import time

def countdown(num_of_secs, color):
    while num_of_secs:
        m, s = divmod(num_of_secs, 60)
        min_sec_format = '{:02d}:{:02d}'.format(m, s), color
        print(min_sec_format)
        time.sleep(1)
        num_of_secs -= 1

class TrafficLight:

    def __init__(self, colors):
        self.__colors = colors

    def  running(self):

        countdown(7, self.__colors[0])
        countdown(2, self.__colors[1])
        countdown(5, self.__colors[2])

p = TrafficLight(['red', 'yellow', 'green'])
p.running()
